Белгипрозем_2017/src/InformationRegisters/мНастройкаПечатиТитульныхЛистовДел/мНастройкаПечатиТитульныхЛистовДел.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мНастройкаПечатиТитульныхЛистовДел</name>
  <resources>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подзаголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подписал1</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Подписал2</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Подписал3</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.мВидыРаботПоДоговорам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЛица</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮрФизЛицо</name>
  <enumValues>
    <name>ЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
  </enumValues>
  <enumValues>
    <name>ЮрЛицоНеРезидент</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредпринимательНеРезидент</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/InformationRegisters/мНастройкаПечатиТитульныхЛистовДел/ManagerModule.bsl
// Переносит данные из обработки мПечатьТитульногоЛистаДела из макета "ТекстыШаблонов"
//  в записи регистра
Процедура ЗаполнитьРегистрДанными() Экспорт
	МакетШаблонов = Обработки.мПечатьТитульногоЛистаДела.ПолучитьМакет("ТекстыШаблонов");

	
	Для й=2 По МакетШаблонов.ВысотаТаблицы Цикл
		ВидЛицаСтрокой = МакетШаблонов.Область(й,7).Текст;
		
		ВидЛица = Перечисления.ЮрФизЛицо.ПустаяСсылка();
		Если ВидЛицаСтрокой = "ФизЛицо" Тогда
			ВидЛица = Перечисления.ЮрФизЛицо.ФизЛицо;
		ИначеЕсли ВидЛицаСтрокой = "ЮрЛицо" Тогда	
			ВидЛица = Перечисления.ЮрФизЛицо.ЮрЛицо;
		КонецЕсли;
		
		НаименованиеВидаРаботы = МакетШаблонов.Область(й,1).Текст;
		ВидРабот = Справочники.мВидыРаботПоДоговорам.НайтиПоНаименованию(НаименованиеВидаРаботы);
		
		Если ЗначениеЗаполнено(ВидРабот) Тогда
			Набор = РегистрыСведений.мНастройкаПечатиТитульныхЛистовДел.СоздатьНаборЗаписей();
			Набор.Отбор.ВидРабот.Установить(ВидРабот);
			Набор.Отбор.ВидЛица.Установить(ВидЛица);
			
			Запись = Набор.Добавить();
			
			Запись.ВидРабот = ВидРабот;
			Запись.ВидЛица = ВидЛица;
			Запись.Заголовок = МакетШаблонов.Область(й,2).Текст;
			Запись.ПодЗаголовок = МакетШаблонов.Область(й,3).Текст;
			Запись.Подписал1 = МакетШаблонов.Область(й,4).Текст = "Да";
			Запись.Подписал2 = МакетШаблонов.Область(й,5).Текст = "Да";
			Запись.Подписал3 = МакетШаблонов.Область(й,6).Текст = "Да";
			
			Попытка
				Набор.Записать();
			Исключение
			
			КонецПопытки; 
		КонецЕсли; 
	КонецЦикла; 
	

КонецПроцедуры
